/**
 * 
 */
/**
 * @author Jorik
 *
 */
package kaydashyaroslav08;

//Завдання:
Покращити попередню л/p, а саме:
	Забезпечити можливість збереження і відновлення масива об'єктів рішення завдання лабораторної роботи номер 7.
	Забороняється використання стандартного протокола серіалізації.
	Продемонструвати використання моделі Long Term Persistence.
	Забезпечити діалог з користувачем у вигляді простого текстового меню.
	При збереженні та відновленні даних забезпечити діалоговий режим вибору директорії з відображенням вмісту і можливістю переміщення по підкаталогах.