/**
 * 
 */
/**
 * @author Jorik
 *
 */
package kaydashyaroslav07;

//Завдання:
	Використовуючи об'єктно-орієнтований аналіз, реалізувати класи для представлення сутностей відповідно прикладної задачі - domain-об'єктів.
	Забезпечити та продемонструвати коректне введення та відображення кирилиці.
	Продемонструвати можливість управління масивом domain-об'єктів.
	Моє індивідуальне завдання - 5.Довідник покупця
	Торгівельна точка: назва; адреса; телефони (кількість не обмежена); спеціалізація; час роботи (з зазначенням днів тижня).