/**
 * 
 */
/**
 * @author Jorik
 *
 */
package kaydashyaroslav06;

//Завдання:
Покращити попередню л/p, а саме:

Реалізувати і продемонструвати тривале зберігання/відновлення раніше розробленого контейнера за допомогою серіалізації/десеріалізації.

Обмінятися відкомпільованим (без початкового коду) службовим класом (Utility Class) рішення задачі л.р номер 3 з іншим студентом (визначає викладач).

Продемонструвати послідовну та вибіркову обробку елементів розробленого контейнера за допомогою власного і отриманого за обміном службового класу.

Реалізувати та продемонструвати порівняння, сортування та пошук елементів у контейнері.

Розробити консольну програму та забезпечити діалоговий режим роботи з користувачем для демонстрації та тестування рішення.